In [1]:
import pandas as pd
import numpy as np

In [2]:
#Sample data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Ethan', 'Fiona'], 
    'Age': [25, 30, 35, 40, 28, 45],
    'City': ['New York', 'Chicago', 'San Diego', 'Chicago', 'New York', 'San Diego'],
    'Salary': [70000, 80000, 90000, 85000, 72000, 88000]

}

#Create Dataframe 
df = pd.DataFrame(data)

#Display it
df.head(10)

      Name  Age       City  Salary
0    Alice   25   New York   70000
1      Bob   30    Chicago   80000
2  Charlie   35  San Diego   90000
3    Diana   40    Chicago   85000
4    Ethan   28   New York   72000
5    Fiona   45  San Diego   88000

 Exercise 1: Filter rows

    Get all rows where the salary is greater than 75,000.

In [3]:
df_salary_filter = df[df['Salary'] > 75000]
print(df_salary_filter)

      Name  Age       City  Salary
1      Bob   30    Chicago   80000
2  Charlie   35  San Diego   90000
3    Diana   40    Chicago   85000
5    Fiona   45  San Diego   88000

Exercise 2: Group and aggregate

    Find the average salary per city.

In [4]:
avg_salary_city = df.groupby('City')['Salary'].mean()
print(avg_salary_city)

City
Chicago      82500.0
New York     71000.0
San Diego    89000.0
Name: Salary, dtype: float64

Exercise 3: Add a column

    Add a new column senior which is True if age â‰¥ 35, else False.

In [5]:
df['Senior'] =df['Age'] >= 35

print(df)

      Name  Age       City  Salary  Senior
0    Alice   25   New York   70000   False
1      Bob   30    Chicago   80000   False
2  Charlie   35  San Diego   90000    True
3    Diana   40    Chicago   85000    True
4    Ethan   28   New York   72000   False
5    Fiona   45  San Diego   88000    True

Exercise 4: Sort values

    Sort the DataFrame by salary descending.

In [6]:
df.sort_values('Salary', ascending=False)

      Name  Age       City  Salary  Senior
2  Charlie   35  San Diego   90000    True
5    Fiona   45  San Diego   88000    True
3    Diana   40    Chicago   85000    True
1      Bob   30    Chicago   80000   False
4    Ethan   28   New York   72000   False
0    Alice   25   New York   70000   False

 Exercise 5: Count distinct values

    How many unique cities are there?

In [7]:
unique_cities= df['City'].nunique()

print(f'There are {unique_cities} unique cities :)')

There are 3 unique cities :)

Expanding the df to make mor exercises:

Add new column: 'Hire_Date'
Add some NaN values for missing salary example

In [8]:

df['Hire_Date']= ['2020-05-15', '2019-07-01', '2021-01-10', '2018-03-20', '2022-09-01', '2017-12-11']

# Convert 'Hire_Date' to datetime
df['Hire_Date'] = pd.to_datetime(df['Hire_Date'])

# Add some NaN values for missing salary example
df.loc[1, 'Salary'] = np.nan  # Bob's salary is missing

df

      Name  Age       City   Salary  Senior  Hire_Date
0    Alice   25   New York  70000.0   False 2020-05-15
1      Bob   30    Chicago      NaN   False 2019-07-01
2  Charlie   35  San Diego  90000.0    True 2021-01-10
3    Diana   40    Chicago  85000.0    True 2018-03-20
4    Ethan   28   New York  72000.0   False 2022-09-01
5    Fiona   45  San Diego  88000.0    True 2017-12-11

In [9]:
# Convert 'Hire_Date' to datetime
df['Hire_Date'] = pd.to_datetime(df['Hire_Date'])

# Add some NaN values for missing salary example
df.loc[1, 'Salary'] = np.nan  # Bob's salary is missing

df

      Name  Age       City   Salary  Senior  Hire_Date
0    Alice   25   New York  70000.0   False 2020-05-15
1      Bob   30    Chicago      NaN   False 2019-07-01
2  Charlie   35  San Diego  90000.0    True 2021-01-10
3    Diana   40    Chicago  85000.0    True 2018-03-20
4    Ethan   28   New York  72000.0   False 2022-09-01
5    Fiona   45  San Diego  88000.0    True 2017-12-11

 Exercise 6: Handle missing data

    Replace missing salaries with the average salary.

In [10]:
avg_salary = df['Salary'].mean()

df['Salary'] = df['Salary'].fillna(avg_salary)

df

      Name  Age       City   Salary  Senior  Hire_Date
0    Alice   25   New York  70000.0   False 2020-05-15
1      Bob   30    Chicago  81000.0   False 2019-07-01
2  Charlie   35  San Diego  90000.0    True 2021-01-10
3    Diana   40    Chicago  85000.0    True 2018-03-20
4    Ethan   28   New York  72000.0   False 2022-09-01
5    Fiona   45  San Diego  88000.0    True 2017-12-11

Exercise 7: Date parsing (if dates available)

    Convert a string column to a date and extract the year.

In [13]:
df['Hire_Year']= df['Hire_Date'].dt.year

df

      Name  Age       City   Salary  Senior  Hire_Date  Hire_Year
0    Alice   25   New York  70000.0   False 2020-05-15       2020
1      Bob   30    Chicago  81000.0   False 2019-07-01       2019
2  Charlie   35  San Diego  90000.0    True 2021-01-10       2021
3    Diana   40    Chicago  85000.0    True 2018-03-20       2018
4    Ethan   28   New York  72000.0   False 2022-09-01       2022
5    Fiona   45  San Diego  88000.0    True 2017-12-11       2017

Exercise 8: Join two DataFrames

    You have a second DataFrame with bonus info. Join it on employee name.

In [14]:
#Bonus dataset to join

bonus_data = {
    'Name': ['Alice', 'Charlie', 'Diana', 'Fiona'],
    'Bonus': [3000, 4000, 2500, 3500]
}

bonus_df = pd.DataFrame(bonus_data)

In [15]:
#Join df with bonus_df on Name

df_joined = pd.merge(df, bonus_df, on= 'Name', how= 'left' )

df_joined

      Name  Age       City   Salary  Senior  Hire_Date  Hire_Year   Bonus
0    Alice   25   New York  70000.0   False 2020-05-15       2020  3000.0
1      Bob   30    Chicago  81000.0   False 2019-07-01       2019     NaN
2  Charlie   35  San Diego  90000.0    True 2021-01-10       2021  4000.0
3    Diana   40    Chicago  85000.0    True 2018-03-20       2018  2500.0
4    Ethan   28   New York  72000.0   False 2022-09-01       2022     NaN
5    Fiona   45  San Diego  88000.0    True 2017-12-11       2017  3500.0

Exercise 9: Running total

    Create a cumulative sum of salaries ordered by age.

In [23]:
df_sorted_age = df.sort_values(by= 'Age')

df_sorted_age['Cumulative_sum'] = df_sorted_age['Salary'].cumsum()
df_sorted_age

,Name,Age,City,Salary,Senior,Hire_Date,Hire_Year,Cumulative_sum
0,Alice,25,New York,70000.0,False,2020-05-15,2020,70000.0
4,Ethan,28,New York,72000.0,False,2022-09-01,2022,142000.0
1,Bob,30,Chicago,81000.0,False,2019-07-01,2019,223000.0
2,Charlie,35,San Diego,90000.0,True,2021-01-10,2021,313000.0
3,Diana,40,Chicago,85000.0,True,2018-03-20,2018,398000.0
5,Fiona,45,San Diego,88000.0,True,2017-12-11,2017,486000.0

Exercise 10: Top N per group

    For each city, get the top 1 highest paid person.

In [25]:
top_earnest = df.loc[df.groupby('City')['Salary'].idxmax()].sort_values(by = 'Salary')

print(top_earnest)

      Name  Age       City   Salary  Senior  Hire_Date  Hire_Year
4    Ethan   28   New York  72000.0   False 2022-09-01       2022
3    Diana   40    Chicago  85000.0    True 2018-03-20       2018
2  Charlie   35  San Diego  90000.0    True 2021-01-10       2021